[ {
  "version" : "v2.10.4",
  "date" : "2019-12-28",
  "changes" : [ {
    "type" : "fix",
    "text" : "Revert 'load all' change made with last version as it causes some search loops. Will need to take a closer look."
  } ]
}, {
  "version" : "v2.10.3",
  "date" : "2019-12-28",
  "changes" : [ {
    "type" : "fix",
    "text" : "With the option to load all results enabled now all available results will actually be loaded."
  }, {
    "type" : "note",
    "text" : "I've removed the feature to migrate from v1 (to reduce the install size and memory usage a bit). It's still possible to migrate in older versions and then update to a current version."
  } ]
}, {
  "version" : "v2.10.2",
  "date" : "2019-12-04",
  "changes" : [ {
    "type" : "feature",
    "text" : "Add option to log HTTP server requests and their response times. The log messages will be written to a file nzbhydra.serv.log and not contained in the debug infos. They might help debug some performance related problems."
  } ]
}, {
  "version" : "v2.10.1",
  "date" : "2019-12-01",
  "changes" : [ {
    "type" : "fix",
    "text" : "Fix db error when trying to save downloaded NZB."
  } ]
}, {
  "version" : "v2.10.0",
  "date" : "2019-11-30",
  "changes" : [ {
    "type" : "fix",
    "text" : "I've changed (fixed) the way indexers are queried when searches are being made. In essence this will fix paging, allowing Radarr/Sonarr to properly read NZBHydra's results over multiple pages. What does that mean for you? *arr will probably find more results when doing backlog searches and NZBHydra will do more indexer searches, resulting in increased API hits (but not more than if you had configured them directly in *arr). For more (technical) details see <a href=\"https://github.com/Sonarr/Sonarr/issues/3132\">this GitHub issue</a>."
  }, {
    "type" : "fix",
    "text" : "Recognize indexers reporting -1 for api or download limit for \"unlimited\"."
  }, {
    "type" : "fix",
    "text" : "Fixed a minor layout issue in the config."
  }, {
    "type" : "fix",
    "text" : "Make sure \"Keep history for ... weeks\" is either empty or set to a positive value."
  }, {
    "type" : "fix",
    "text" : "The download history didn't load properly when the option to delete old searches from the history was set."
  } ]
}, {
  "version" : "v2.9.5",
  "date" : "2019-11-23",
  "changes" : [ {
    "type" : "feature",
    "text" : "I realised the indexer score is too complex to show in a chart and replaced it with a table, that shows more information. It will now contain the average uniqueness score, the number of unique downloads and the number of searches which resulted in a download and where an indexer was involved. "
  } ]
}, {
  "version" : "v2.9.4",
  "date" : "2019-11-21",
  "changes" : [ {
    "type" : "fix",
    "text" : "Further improvements regarding uniqueness score."
  } ]
}, {
  "version" : "v2.9.3",
  "date" : "2019-11-20",
  "changes" : [ {
    "type" : "feature",
    "text" : "Some indexers report their API and download limits in their XMLs. NZBHydra will detect that when the indexer's caps are checked and will automatically fill out the config accordingly (keeping already set values as they are)."
  } ]
}, {
  "version" : "v2.9.2",
  "date" : "2019-11-17",
  "changes" : [ {
    "type" : "fix",
    "text" : "Actually show version dates in the updates page..."
  } ]
}, {
  "version" : "v2.9.1",
  "date" : "2019-11-17",
  "changes" : [ {
    "type" : "fix",
    "text" : "Further adjustment to uniqueness score."
  } ]
}, {
  "version" : "v2.9.0",
  "date" : "2019-11-17",
  "changes" : [ {
    "type" : "feature",
    "text" : "I've updated the indexer uniqueness score calculation so that indexers which are often involved in searches get a higher score than those rarely involved. I also found a bug in the way the data was stored to the database so the old values will be removed."
  }, {
    "type" : "feature",
    "text" : "The changelog now contains release dates along with the version."
  }, {
    "type" : "feature",
    "text" : "Added option to disable update banner when running docker."
  } ]
}, {
  "version" : "v2.8.4",
  "date" : "2019-11-14",
  "changes" : [ {
    "type" : "fix",
    "text" : "Cached torznab results were returned as wrong XML. Also cached torznab and newznab queries could conflict."
  } ]
}, {
  "version" : "v2.8.3",
  "date" : "2019-11-14",
  "changes" : [ {
    "type" : "fix",
    "text" : "Improve logging and handling of torznab/newznab XML transformation."
  } ]
}, {
  "version" : "v2.8.2",
  "date" : "2019-11-13",
  "changes" : [ {
    "type" : "feature",
    "text" : "Support for pourcesoir.in, a french indexer. Their dev approached me with an idea on how to work around laws forbidding hosting NZB files. The indexer provides a certain text for each result using which you will find the result using a raw search engine like binsearch. NZBHydra will display a search icon in the search results GUI via which you can search for the result on Binsearch. I'll be honest, I'm not sure how viable that approach is, but I'm open to new ideas."
  }, {
    "type" : "fix",
    "text" : "Fix pagination display error with."
  } ]
}, {
  "version" : "v2.8.1",
  "date" : "2019-11-11",
  "changes" : [ {
    "type" : "feature",
    "text" : "Allow to define sorting for the search results via URL parameters. Use &sortby=<column> and, optionally, &sortdirection=asc or &sortdirection=desc. This will take preference to the sorting settings saved in a cookie but not overwrite them."
  } ]
}, {
  "version" : "v2.8.0",
  "date" : "2019-11-08",
  "changes" : [ {
    "type" : "fix",
    "text" : "Hydra will use proper HTTP status codes when NZB download fails to signal that an indexer's API limit is reached. This will be recognized by *arr, which will skip the release and try another one. This will also prevent *arr from disabling NZBHydra in such cases."
  }, {
    "type" : "fix",
    "text" : "Fix minor issue in indexer uniqueness score calculation."
  } ]
}, {
  "version" : "v2.7.7",
  "date" : "2019-11-04",
  "changes" : [ {
    "type" : "fix",
    "text" : "Indexer uniqueness score had wrong axis labels in the stats page."
  } ]
}, {
  "version" : "v2.7.6",
  "date" : "2019-11-04",
  "changes" : [ {
    "type" : "feature",
    "text" : "Restore the indexer uniqueness score introduced with 2.7.0 and then rolled back due to database migration problems. The database is now restored on startup which should prevent any migration errors. The startup will take a while for this update."
  } ]
}, {
  "version" : "v2.7.5",
  "date" : "2019-10-30",
  "changes" : [ {
    "type" : "fix",
    "text" : "Fix 'You're not allowed...' error caused by the fix in 2.7.4... :-/"
  } ]
}, {
  "version" : "v2.7.4",
  "date" : "2019-10-29",
  "changes" : [ {
    "type" : "fix",
    "text" : "Fix 'You're not allowed...' error related to security cookie. Thanks to /u/routhinator for the hint."
  } ]
}, {
  "version" : "v2.7.3",
  "date" : "2019-10-27",
  "changes" : [ {
    "type" : "feature",
    "text" : "Added option to configure cover width in search results."
  }, {
    "type" : "fix",
    "text" : "TMDB capabilities were not correctly checked."
  }, {
    "type" : "note",
    "text" : "I've added instructions to send one-time donations via PayPal and recurring donations via Github Sponsors."
  } ]
}, {
  "version" : "v2.7.2",
  "date" : "2019-10-06",
  "changes" : [ {
    "type" : "fix",
    "text" : "I had to revert the changes from 2.7.0 because for some reason some databases could not be migrated. I'll need to take a closer look first, sorry."
  } ]
}, {
  "version" : "v2.7.1",
  "date" : "2019-10-06",
  "changes" : [ {
    "type" : "fix",
    "text" : "Hopefully fix a problem which might prevent a successful database migration for some instances."
  } ]
}, {
  "version" : "v2.7.0",
  "date" : "2019-10-06",
  "changes" : [ {
    "type" : "feature",
    "text" : "I've added a new statistics value called \"Indexer result uniqueness score\" (which is is a mouthful, if you have a better name please let me know). This score attempts to answer the question: Which indexer should I keep and which can I let go? See <a href=\"https://github.com/theotherp/nzbhydra2/wiki/Indexer-results-uniqueness-score\">the wiki for more information</a>. The score will only work for new downloads."
  } ]
}, {
  "version" : "v2.6.18",
  "date" : "2019-09-29",
  "changes" : [ {
    "type" : "feature",
    "text" : "Add global cache time config parameter"
  } ]
}, {
  "version" : "v2.6.17",
  "date" : "2019-09-07",
  "changes" : [ {
    "type" : "feature",
    "text" : "Allow indexers to be used only for API update queries"
  }, {
    "type" : "feature",
    "text" : "Allow regular expressions to be used in the search results title filter"
  } ]
}, {
  "version" : "v2.6.16",
  "date" : "2019-09-05",
  "changes" : [ {
    "type" : "fix",
    "text" : "Fix problems with special characters when using autocomplete"
  } ]
}, {
  "version" : "v2.6.15",
  "date" : "2019-09-04",
  "changes" : [ {
    "type" : "fix",
    "text" : "Fix form auth and remember-me cookies"
  } ]
}, {
  "version" : "v2.6.14",
  "date" : "2019-08-12",
  "changes" : [ {
    "type" : "fix",
    "text" : "Minor changes"
  } ]
}, {
  "version" : "v2.6.13",
  "date" : "2019-08-12",
  "changes" : [ {
    "type" : "fix",
    "text" : "Hopefully fix error with CookieTheftException introduced with v2.6.12"
  } ]
}, {
  "version" : "v2.6.12",
  "date" : "2019-08-04",
  "changes" : [ {
    "type" : "features",
    "text" : "Allow limiting the indexers to be used via API. Use \"&indexers=<name1>,<name2>\"."
  }, {
    "type" : "fix",
    "text" : "Reduce how long sessions are kept open, possible reducing memory usage in some cases"
  } ]
}, {
  "version" : "v2.6.11",
  "date" : "2019-06-09",
  "changes" : [ {
    "type" : "fix",
    "text" : "Improve handling and performance of wildcards for removal of trailing words"
  }, {
    "type" : "fix",
    "text" : "Added option to define how long Hydra will try to compress the database file when shutting down. With big databases shutting down may take up to 15 seconds by default. I'm still working on analyzing why some databases grow very large. Until I've found a way to prevent the root cause this option may help a bit but it will still require Hydra to shut down (or restart)"
  } ]
}, {
  "version" : "v2.6.10",
  "date" : "2019-05-21",
  "changes" : [ {
    "type" : "fix",
    "text" : "Changing result selection using \"Invert selection\" and \"Select/deselect all\" wasn't properly registered, making mass download buttons unusable"
  }, {
    "type" : "fix",
    "text" : "Error on startup on headless windows server"
  } ]
}, {
  "version" : "v2.6.9",
  "date" : "2019-05-17",
  "changes" : [ {
    "type" : "fix",
    "text" : "Remove trailing didn't work with words containing \"s\"... How do you explain stuff to that to non-programmers..."
  }, {
    "type" : "fix",
    "text" : "USe localhost:8080 as preset sabNZBd URL"
  } ]
}, {
  "version" : "v2.6.8",
  "date" : null,
  "changes" : [ {
    "type" : "fix",
    "text" : "IMDB link in search history was invalid"
  } ]
}, {
  "version" : "v2.6.7",
  "date" : "2019-05-15",
  "changes" : [ {
    "type" : "fix",
    "text" : "Hopefully fix corruption of nzbhydra.yml when machine crashes (or user switches off power deliberately -.-)"
  } ]
}, {
  "version" : "v2.6.6",
  "date" : "2019-05-14",
  "changes" : [ {
    "type" : "fix",
    "text" : "Fix NoClassDefFoundError (only occurred with HTTP logging marker enabled)"
  } ]
}, {
  "version" : "v2.6.5",
  "date" : "2019-05-14",
  "changes" : [ {
    "type" : "fix",
    "text" : "Fix shift-click for selecting multiple results."
  } ]
}, {
  "version" : "v2.6.4",
  "date" : "2019-05-14",
  "changes" : [ {
    "type" : "fix",
    "text" : "Searches will always use the IDs provided in API calls and not replace them by different IDs provided by IMDB or TVMaze. In very few instances TVMaze had wrong IDs mapped which resulted in wrong searches."
  }, {
    "type" : "fix",
    "text" : "Entering domains to bypass when using proxy didn't work."
  }, {
    "type" : "fix",
    "text" : "Selecting multiple results in the same title group was not accepted."
  } ]
}, {
  "version" : "v2.6.3",
  "date" : "2019-05-13",
  "changes" : [ {
    "type" : "feature",
    "text" : "Extended logging for download status updates."
  }, {
    "type" : "feature",
    "text" : "Allow wildcards in \"Remove trailing...\""
  }, {
    "type" : "fix",
    "text" : "Disable HSTS security header"
  } ]
}, {
  "version" : "v2.6.2",
  "date" : "2019-05-05",
  "changes" : [ {
    "type" : "fix",
    "text" : "The warning that the wrapper is outdated will be also displayed in the updates section. You can also choose to be reminded again."
  }, {
    "type" : "fix",
    "text" : "Update link to Font Awesome in downloader config to the version actually supported."
  } ]
}, {
  "version" : "v2.6.1",
  "date" : "2019-05-02",
  "changes" : [ {
    "type" : "feature",
    "text" : "Allow indexers to be enabled for all searches but API update searches, i.e. those periodically done by Sonarr and others to get the latest releases."
  }, {
    "type" : "fix",
    "text" : "Correctly report torznab caps (taking into regard only torznab indexers). Also disregard any disabled indexers or those not enabled for API searches and include IDs convertible to any of the supported IDs."
  } ]
}, {
  "version" : "v2.6.0",
  "date" : "2019-05-01",
  "changes" : [ {
    "type" : "feature",
    "text" : "Warn when using config that violates indexer rules and that will result in your API account being disabled."
  }, {
    "type" : "feature",
    "text" : "Support IMDB IDs for TV search. This seems to be supported by few indexers but by many trackers."
  }, {
    "type" : "feature",
    "text" : "Add option to ignore load limiting for internal searches."
  }, {
    "type" : "feature",
    "text" : "Sort indexers in config by state first, then score, then name."
  }, {
    "type" : "fix",
    "text" : "NZBHydra used to always report all ID types (e.g. IMDB IDs) in the caps to be supported. Now IDs will only be reported as supported if either at least one configured indexer supports it or query generation is enabled."
  }, {
    "type" : "fix",
    "text" : "Prevent log file download from accessing files outside data folder."
  }, {
    "type" : "fix",
    "text" : "Parse indexer results with provided passwords correctly (although they don't follow the spec...)."
  } ]
}, {
  "version" : "v2.5.9",
  "date" : "2019-04-27",
  "changes" : [ {
    "type" : "fix",
    "text" : "I used a discord invitation link that expires after one day. Use this one: [https://discord.gg/uh9W3rd](https://discord.gg/uh9W3rd)."
  } ]
}, {
  "version" : "v2.5.8",
  "date" : "2019-04-27",
  "changes" : [ {
    "type" : "feature",
    "text" : "Recognize when an outdated wrapper is being used and ask the user to update it manually."
  }, {
    "type" : "fix",
    "text" : "Don't complain about mixed newznab and torznab results when adding Anime Tosho."
  }, {
    "type" : "fix",
    "text" : "Removed nzbs.org from the presets :-( RIP"
  } ]
}, {
  "version" : "v2.5.7",
  "date" : "2019-04-27",
  "changes" : [ {
    "type" : "feature",
    "text" : "Attempt to automatically detect certain problems and inform the user (admin) about it. For now this will only detect OutOfMemory errors which cannot be properly handled when they occur."
  }, {
    "type" : "fix",
    "text" : "Disable the grouping of TV results by episode when searching for a specific episode. Also show information about the grouping the first time it is used."
  }, {
    "type" : "note",
    "text" : "The python wrapper nzbhydra2wrapper.py which is the main entry point for the program is now included in the linux release. If you start Hydra using that python file it will be updated automatically although changes will only take effect after the next restart of the main process."
  }, {
    "type" : "note",
    "text" : "I was asked for a discord channel. This is it: [https://discord.gg/uh9W3rd](https://discord.gg/uh9W3rd). I can't promise I'll be the regularly but feel free to join. Some users there and on reddit are always willing to help (thanks, guys!)."
  } ]
}, {
  "version" : "v2.5.6",
  "date" : null,
  "changes" : [ {
    "type" : "fix",
    "text" : "Provide a (better) error message when clicking the infos for a show with TVRage ID for which no infos could be found."
  } ]
}, {
  "version" : "v2.5.5",
  "date" : "2019-04-17",
  "changes" : [ {
    "type" : "feature",
    "text" : "Option to log/display hosts instead of IP addresses. I haven't found a proper way of testing this so let me know if it works ;-)"
  } ]
}, {
  "version" : "v2.5.4",
  "date" : "2019-04-16",
  "changes" : [ {
    "type" : "fix",
    "text" : "Allow empty movie searches for NZBPlanet which should result in covers being shown."
  } ]
}, {
  "version" : "v2.5.3",
  "date" : "2019-04-16",
  "changes" : [ {
    "type" : "fix",
    "text" : "Update of downloader status failed with newsbin (which claims to be compatible with the sabnzbd API)."
  } ]
}, {
  "version" : "v2.5.2",
  "date" : "2019-04-15",
  "changes" : [ {
    "type" : "fix",
    "text" : "Minor downloader status bar related fixes."
  } ]
}, {
  "version" : "v2.5.1",
  "date" : "2019-04-14",
  "changes" : [ {
    "type" : "feature",
    "text" : "Display status of configured downloader on the bottom of the page. This can be disabled in the downloading config. If multiple downloaders are configured the first one is used."
  }, {
    "type" : "fix",
    "text" : "Toggling the grouping of TV episodes or the display of TV/movie covers will take effect without having to reload the search."
  } ]
}, {
  "version" : "v2.4.4",
  "date" : "2019-04-12",
  "changes" : [ {
    "type" : "feature",
    "text" : "Reduced font size across the board to fit more results / buttons / whatever on the page. Let me know if it's too tiny :-)"
  }, {
    "type" : "fix",
    "text" : "Add 6box and NZBPlanet to list of indexers which do not support TV or movie searches without identifiers."
  } ]
}, {
  "version" : "v2.4.3",
  "date" : "2019-04-10",
  "changes" : [ {
    "type" : "fix",
    "text" : "Make sure that 100 rows are shown when grouping results (either by season/episode or by title)."
  }, {
    "type" : "fix",
    "text" : "Passwords for users were not properly migrated from v1."
  } ]
}, {
  "version" : "v2.4.2",
  "date" : "2019-04-10",
  "changes" : [ {
    "type" : "fix",
    "text" : "As is tradition every feature release (2.4.0) is followed by a couple of bug fix releases... The tv episode sorting should not throw any errors now and actually work properly :-)"
  } ]
}, {
  "version" : "v2.4.1",
  "date" : "2019-04-10",
  "changes" : [ {
    "type" : "fix",
    "text" : "Daily episodes (like 04/08) were not parsed correctly, resulting in an error (see 2.4.0 feature)."
  } ]
}, {
  "version" : "v2.4.0",
  "date" : "2019-04-09",
  "changes" : [ {
    "type" : "feature",
    "text" : "When searching in the TV categories in the GUI by default the results will be grouped by season & episode instead of by title. This should make it easier to select one result for every episode which is usually what you want. This behavior can be switched off in the display options (do a new search after the switch)."
  }, {
    "type" : "fix",
    "text" : "Minor improvements to colors in bright theme."
  } ]
}, {
  "version" : "v2.3.22",
  "date" : "2019-04-04",
  "changes" : [ {
    "type" : "feature",
    "text" : "Logging marker to log HTTPS related stuff on debug level."
  }, {
    "type" : "fix",
    "text" : "Removed an SSL related parameter from the wrapper. I already did this months ago but forgot to update the binary for linux. So if you have problems with SSL and are running Hydra on linux (not in docker) you might want to update the binary. This needs to be done manually."
  } ]
}, {
  "version" : "v2.3.21",
  "date" : "2019-03-31",
  "changes" : [ {
    "type" : "feature",
    "text" : "Option to send the mapped category name to downloaders."
  }, {
    "type" : "fix",
    "text" : "/api/stats/indexers endpoint was accessible without authorization."
  }, {
    "type" : "fix",
    "text" : "Show unit for average response times in stats (ms)."
  } ]
}, {
  "version" : "v2.3.20",
  "date" : null,
  "changes" : [ {
    "type" : "fix",
    "text" : "Revert revert because, as it turns out, it wasn't the libary at fault but the new version just failed to read a file already corrupted."
  } ]
}, {
  "version" : "v2.3.19",
  "date" : "2019-03-20",
  "changes" : [ {
    "type" : "fix",
    "text" : "Revert update of database library as it caused errors on startup in some issues."
  } ]
}, {
  "version" : "v2.3.18",
  "date" : "2019-03-18",
  "changes" : [ {
    "type" : "fix",
    "text" : "Not all API keys were anonymized when creating the debug infos."
  } ]
}, {
  "version" : "v2.3.17",
  "date" : "2019-03-17",
  "changes" : [ {
    "type" : "feature",
    "text" : "Binsearch is knowing for returning a 503 error every now and then. In that case Hydra will retry the search up to two times."
  }, {
    "type" : "fix",
    "text" : "An indexer not selected due to load limiting was displayed as being disabled in the GUI."
  }, {
    "type" : "fix",
    "text" : "Reduce frequency of config file being written."
  } ]
}, {
  "version" : "v2.3.16",
  "date" : "2019-03-14",
  "changes" : [ {
    "type" : "fix",
    "text" : "Add database index to improve loading of search history on initial page load."
  }, {
    "type" : "fix",
    "text" : "Try to prevent config file from being corrupted."
  } ]
}, {
  "version" : "v2.3.15",
  "date" : "2019-02-16",
  "changes" : [ {
    "type" : "note",
    "text" : "I need to make something clear: If Hydra shows you 100 results on the GUI and says that x results are not yet loaded then that means that some results you're looking for may be missing. You will always only get the newest 100 results from any indexer at first. Even if you sort by name then other results which should be somewhere in that list may be 'hidden' because they were not yet retrieved from the indexer."
  }, {
    "type" : null,
    "text" : "Delay writing of config file so that not too many concurrent writes occur. This should hopefully reduce the risk of file corruption."
  } ]
}, {
  "version" : "v2.3.14",
  "date" : "2019-02-15",
  "changes" : [ {
    "type" : "fix",
    "text" : "Change how SNI verification is disabled so that nzbgeek.info should work with Java 10+."
  }, {
    "type" : "fix",
    "text" : "Fix NZBIndex parsing. Thanks to BenoitCharret."
  } ]
}, {
  "version" : "v2.3.13",
  "date" : "2019-02-12",
  "changes" : [ {
    "type" : "feature",
    "text" : "Improve HTTP debug logging"
  }, {
    "type" : "fix",
    "text" : "Revert some more SSL related changes. If you still have problems connecting to indexer please manually update the binaries. Unfortunately the update process can't do that."
  } ]
}, {
  "version" : "v2.3.12",
  "date" : "2019-02-10",
  "changes" : [ {
    "type" : "fix",
    "text" : "I don't know if I should laugh or cry, but the last version actually made matters worse as 2.3.11 is unable to connect to GitHub (among others) which disables the built in update function. So if you read this and don't run docker, you'll have to update manually."
  } ]
}, {
  "version" : "v2.3.11",
  "date" : "2019-02-10",
  "changes" : [ {
    "type" : "fix",
    "text" : "Cautiously optimistic that *some* SSL issues have been solved... ;-)"
  }, {
    "type" : "fix",
    "text" : "When implementing the display of covers I managed to mistakenly think that posters and covers are the same. Actually the poster in this context is the uploader but my code used the poster (username) as cover URL. If you've disabled the display of 'posters' in the search results you'll have to disable it again."
  } ]
}, {
  "version" : "v2.3.10",
  "date" : "2019-02-09",
  "changes" : [ {
    "type" : "fix",
    "text" : "Fix another issue with SSL. I should probably pause development until I'm fit of mind enough to do this properly..."
  } ]
}, {
  "version" : "v2.3.9",
  "date" : "2019-02-09",
  "changes" : [ {
    "type" : "fix",
    "text" : "Revert SSL changes made in 2.3.7 as Hydra didn't start for some users. I give up."
  } ]
}, {
  "version" : "v2.3.8",
  "date" : "2019-02-09",
  "changes" : [ {
    "type" : "fix",
    "text" : "Updated executable to provide a java flag which should fix SSL related problems introduced with 2.3.7. If you're not running Hydra inside a container you may need to manually update the binary (nzbhydra*.exe or just nzbhydra on linux)"
  } ]
}, {
  "version" : "v2.3.7",
  "date" : "2019-02-09",
  "changes" : [ {
    "type" : "fix",
    "text" : "Changed the way SSL certificates are checked. Connection to indexers like NZBGeek or althub should now work as expected. Removed the option 'Disable SNI'."
  }, {
    "type" : "fix",
    "text" : "Count API hits used for connection and caps checks when calculating hit limits."
  }, {
    "type" : "fix",
    "text" : "When results are sorted by title the title groups are now sorted by indexer score instead of age, meaning results from the indexer with the highest score are shown when the title group is collapsed."
  } ]
}, {
  "version" : "v2.3.6",
  "date" : "2019-02-06",
  "changes" : [ {
    "type" : "fix",
    "text" : "The audio category was preconfigured to require both mp3 and flac in the results which doesn't make any sense. You might want to remove them in your category config."
  }, {
    "type" : "fix",
    "text" : "Old downloads were not removed from history even if the option to only keep them for a certain time was set."
  }, {
    "type" : "fix",
    "text" : "Check cover/poster URLs provided by indexers to catch some invalid URLs."
  } ]
}, {
  "version" : "v2.3.5",
  "date" : "2019-02-05",
  "changes" : [ {
    "type" : "feature",
    "text" : "Show posters for movie results. Can be toggled in the display options."
  } ]
}, {
  "version" : "v2.3.4",
  "date" : "2019-01-31",
  "changes" : [ {
    "type" : "fix",
    "text" : "Move cancel button in dialog shown while searching because you're all too slow to click it."
  }, {
    "type" : "fix",
    "text" : "Prevent database trace file becoming too large"
  }, {
    "type" : "fix",
    "text" : "Keep less gclog files in the log folder"
  } ]
}, {
  "version" : "v2.3.3",
  "date" : "2019-01-28",
  "changes" : [ {
    "type" : "fix",
    "text" : "Connection to hosts like 'sabnzd' would fail"
  } ]
}, {
  "version" : "v2.3.2",
  "date" : "2019-01-27",
  "changes" : [ {
    "type" : "fix",
    "text" : "2.3.1 didn't start for users updating from 2.2.5 to 2.3.1. Fuck this shit"
  } ]
}, {
  "version" : "v2.3.1",
  "date" : "2019-01-27",
  "changes" : [ {
    "type" : "fix",
    "text" : "2.2.5 unfortunately may have caused database corruption in some cases. Hopefully no more... The fix may need some time the first time this new version is started."
  } ]
}, {
  "version" : "v2.3.0",
  "date" : "2019-01-27",
  "changes" : [ {
    "type" : "feature",
    "text" : "Java 11 is now supported. This required an update of the internal framework which might have some unforseen side effects (bugs), especially regarding authentification and handling of reverse proxies. Let me know if something doesn't work as expected."
  }, {
    "type" : "feature",
    "text" : "Rename searching option 'Ignore temporarily disabled' to 'Ignore temporary errors'. If enabled indexers will not be temporarily disabled at all if a recoverable error occurs."
  }, {
    "type" : "fix",
    "text" : "Opening magnet links under Windows 7 doesn't require administrator rights anymore."
  } ]
}, {
  "version" : "v2.2.5",
  "date" : "2019-01-26",
  "changes" : [ {
    "type" : "fix",
    "text" : "In some cases (with really big databases) the check of the API hit limit could take very long. This was hopefully improved. Migration to this version might take a bit for such instances."
  } ]
}, {
  "version" : "v2.2.4",
  "date" : "2019-01-26",
  "changes" : [ {
    "type" : "feature",
    "text" : "Add indexer specific limit to caps check. Background: RARBG only allows one request every two seconds so the caps check, which until now used two concurrent threads and a delay of 1 second, would result in errors. The limits are hard coded. Hydra will not attempt to do any rate limiting for regular search requests."
  } ]
}, {
  "version" : "v2.2.3",
  "date" : "2019-01-26",
  "changes" : [ {
    "type" : "feature",
    "text" : "Include database metadata in debug infos"
  } ]
}, {
  "version" : "v2.2.2",
  "date" : "2019-01-26",
  "changes" : [ {
    "type" : "feature",
    "text" : "Minor improvements to performance logging"
  } ]
}, {
  "version" : "v2.2.1",
  "date" : "2019-01-21",
  "changes" : [ {
    "type" : "feature",
    "text" : "Improve logging of unparseable indexer responses"
  } ]
}, {
  "version" : "v2.2.0",
  "date" : "2019-01-02",
  "changes" : [ {
    "type" : "note",
    "text" : "This release brings some major changes regarding categories and the handling of newznab categories. Please let me know if it breaks anything or has unexpected side effects (or if you love what I've done ;-))"
  }, {
    "type" : "feature",
    "text" : "Allow combinations of newznab categories which must all be found in a search result for that category to be applied. For example 4090&11000 will only match items with both 4090 and 11000. This should allow for even finer category tuning with trackers accessed via Jackett."
  }, {
    "type" : "feature",
    "text" : "Replace newznab categories incoming API searches with newznab categories of mapped category. For example when you have 2040,2050 configured for Movies HD and a search comes in using 2040 then indexers will be queried using 2040,2050. Until now only the supplied category was used (2040 in the example). This should result in more results to be found and so far I can't tell if it will return just better results or more crap. You can disable this with the 'Transform newznab categories' setting in the searching config."
  }, {
    "type" : "feature",
    "text" : "Related to above: The categories on the caps page are created from the configured categories. To keep this clean only one newznab category will be used for every category (e.g. Movies HD using 2040,2050 will only be included once with 2040 as ID."
  }, {
    "type" : "fix",
    "text" : "Use dereferer for NZB details site"
  } ]
}, {
  "version" : "v2.1.7",
  "date" : "2018-12-30",
  "changes" : [ {
    "type" : "fix",
    "text" : "Fix/improve category mapping introduced in 2.1.6. Use custom newznab categories if none from the predefined range are provided."
  } ]
}, {
  "version" : "v2.1.6",
  "date" : "2018-12-30",
  "changes" : [ {
    "type" : "fix",
    "text" : "When uploading a backup file the UI didn't update to inform the user about the progress after the file was uploaded."
  }, {
    "type" : "fix",
    "text" : "Improve category mapping for (torznab) indexers. Some use custom newznab category numbers (>9999) which could not be properly mapped to preconfigured categories."
  } ]
}, {
  "version" : "v2.1.5",
  "date" : "2018-12-29",
  "changes" : [ {
    "type" : "fix",
    "text" : "Improve handling of movie and tv searches with some indexers (see v2.0.23). I just wish all indexers could work the same... :-/"
  }, {
    "type" : "fix",
    "text" : "Prevent indexers without caps from being caps checked (NZBIndex, Binsearch)"
  }, {
    "type" : "fix",
    "text" : "Improve wording indexer state when disabled by the system due to an error from which it cannot recover automatically"
  } ]
}, {
  "version" : "v2.1.4",
  "date" : "2018-12-28",
  "changes" : [ {
    "type" : "feature",
    "text" : "Allow retrieval of history and stats via API. See https://github.com/theotherp/nzbhydra2/wiki/External-API,-RSS-and-cached-queries"
  }, {
    "type" : "fix",
    "text" : "Repeat of searches from history sometimes used wrong parameters"
  }, {
    "type" : "fix",
    "text" : "Added nzbs.org to list of indexers unable to process type searches without IDs"
  } ]
}, {
  "version" : "v2.1.3",
  "date" : "2018-12-27",
  "changes" : [ {
    "type" : "fix",
    "text" : "Removed dead indexers from presets"
  }, {
    "type" : "fix",
    "text" : "Prevent exception related to duplicate TV infos in database"
  } ]
}, {
  "version" : "v2.1.2",
  "date" : "2018-12-18",
  "changes" : [ {
    "type" : "fix",
    "text" : "Indexer added as newznab indexer even when selected as torznab in the config GUI"
  } ]
}, {
  "version" : "v2.1.1",
  "date" : "2018-12-18",
  "changes" : [ {
    "type" : "fix",
    "text" : "Validate config to prevent indexers with duplicate names"
  }, {
    "type" : "fix",
    "text" : "Validate config to prevent torznab indexers being added as newznab indexer and vice versa"
  } ]
}, {
  "version" : "v2.1.0",
  "date" : "2018-12-15",
  "changes" : [ {
    "type" : "fix",
    "text" : "Search query was not built properly when conversion of search IDs did not provide any IDs usable by an indexer"
  }, {
    "type" : "feature",
    "text" : "Support API caps in JSON"
  } ]
}, {
  "version" : "v2.0.24",
  "date" : "2018-12-14",
  "changes" : [ {
    "type" : "note",
    "text" : "Added NZBGeek to the list mentioned in v2.0.23. Thanks to the user letting me know about it."
  } ]
}, {
  "version" : "v2.0.23",
  "date" : "2018-12-11",
  "changes" : [ {
    "type" : "note",
    "text" : "Previously when an API call with search type 'movie' or 'tvsearch' was made without any identifiers or category I would call indexers with search type 'search' instead because some indexers don't like that. This causes some other problems so I've reverted that behavior except for a certain list of indexers. I have hardcoded list of indexers for which the switch will be done. I'm not sure which indexers actually behave that way. So if you find an indexer where browsing the movie or TV releases (e.g. using NZB360) will return a lot of crap please let me know so I can add the indexer to the list."
  }, {
    "type" : "note",
    "text" : "I've changed the java runtime that is used in the docker container maintained by me (although I actually don't want to really support that...). In my tests it nearly halved memory usage in some scenarios (199MB compared to 380MB). If this proves to be stable I'll recommend the other maintainers to use this as well."
  } ]
}, {
  "version" : "v2.0.22",
  "date" : "2018-12-09",
  "changes" : [ {
    "type" : "fix",
    "text" : "Upload of large ZIP files for restoration was disabled"
  } ]
}, {
  "version" : "v2.0.21",
  "date" : "2018-12-09",
  "changes" : [ {
    "type" : "feature",
    "text" : "Some users have reported corrupted config files. I can't explain how that could ever happen but I've added code that tries to recognize this on startuppu and attempts to repair it automatically"
  }, {
    "type" : "fix",
    "text" : "New instances were not properly initialized, in some instances resulting in a crash on startup. Sorry about that"
  } ]
}, {
  "version" : "v2.0.20",
  "date" : "2018-12-08",
  "changes" : [ {
    "type" : "feature",
    "text" : "Make sure existing configuration or database is not loaded by an older version of a program than it was created with"
  } ]
}, {
  "version" : "v2.0.19",
  "date" : "2018-12-08",
  "changes" : [ {
    "type" : "fix",
    "text" : "Restoration from uploaded backup file wouldn't work"
  } ]
}, {
  "version" : "v2.0.18",
  "date" : "2018-12-05",
  "changes" : [ {
    "type" : "fix",
    "text" : "Details link was hidden even if not restricted by auth config"
  }, {
    "type" : "fix",
    "text" : "Redirects to torrent magnet links are now recognized and properly handled"
  }, {
    "type" : "fix",
    "text" : "Downloads of NZBs with spaces in the filename are now properly handled"
  }, {
    "type" : "fix",
    "text" : "Suffix NZBs sent to sabnzbd with .nzb to increase compatibility with newsbin"
  } ]
}, {
  "version" : "v2.0.17",
  "date" : "2018-11-22",
  "changes" : [ {
    "type" : "feature",
    "text" : "Automatic update. This feature has been requested for ages. Ironically, now that I rarely release new versions I've finally implemented it. It's opt-in for now even though the update process has been really stable for a while. Now that the startup is faster Hydra shouldn't be unavailable during the update process for more than 20 seconds or so. Any tools calling during that time should recover fine."
  }, {
    "type" : "fix",
    "text" : "Make sure to load resources from TVMaze using HTTPS"
  }, {
    "type" : "fix",
    "text" : "Handle (invalid) spaces in URLs"
  } ]
}, {
  "version" : "v2.0.16",
  "date" : "2018-11-21",
  "changes" : [ {
    "type" : "fix",
    "text" : "Size tag was not forwarded from torznab results"
  } ]
}, {
  "version" : "v2.0.15",
  "date" : "2018-11-02",
  "changes" : [ {
    "type" : "fix",
    "text" : "ID lookup for TV shows didn't always work"
  } ]
}, {
  "version" : "v2.0.14",
  "date" : "2018-11-02",
  "changes" : [ {
    "type" : "note",
    "text" : "The URL base has to start with a / from now on. Configs without URL base will be migrated"
  }, {
    "type" : "fix",
    "text" : "ID based TV search from GUI would sometimes ignore ID"
  } ]
}, {
  "version" : "v2.0.13",
  "date" : "2018-10-26",
  "changes" : [ {
    "type" : "feature",
    "text" : "Warn when changing the host to an invalid IP"
  }, {
    "type" : "fix",
    "text" : "api.althub.co.za should hopefully actually work now"
  } ]
}, {
  "version" : "v2.0.12",
  "date" : "2018-10-24",
  "changes" : [ {
    "type" : "fix",
    "text" : "SSL error when accessing althub from docker. Should be fixed with the setting to use the packaged cacerts file enabled"
  }, {
    "type" : "fix",
    "text" : "Detection and handling of required restart after changing config was broken"
  } ]
}, {
  "version" : "v2.0.11",
  "date" : "2018-10-23",
  "changes" : [ {
    "type" : "feature",
    "text" : "Allow to disable SSL verification only for certain hosts"
  }, {
    "type" : "feature",
    "text" : "Warn when host is changed from 0.0.0.0 and run in docker. This seems to cause some problems"
  } ]
}, {
  "version" : "v2.0.10",
  "date" : "2018-10-20",
  "changes" : [ {
    "type" : "fix",
    "text" : "Sometimes search IDs would be used even if the indexer wasn't configured to use them, resulting in failing searches"
  } ]
}, {
  "version" : "v2.0.9",
  "date" : "2018-10-06",
  "changes" : [ {
    "type" : "fix",
    "text" : "Caps check with Jackett indexers wouldn't complete properly due to a change in their code"
  } ]
}, {
  "version" : "v2.0.8",
  "date" : "2018-10-01",
  "changes" : [ {
    "type" : "fix",
    "text" : "Adapt database to store long torrent magnet links"
  } ]
}, {
  "version" : "v2.0.7",
  "date" : null,
  "changes" : [ {
    "type" : "fix",
    "text" : "Sabnzbd API key was not migrated"
  } ]
}, {
  "version" : "v2.0.6",
  "date" : "2018-09-26",
  "changes" : [ {
    "type" : "fix",
    "text" : "Torznab queries were limited to 100 results. I've removed the limit altogether. As torznab doesn't require or support paging there's no reason for a request limit"
  } ]
}, {
  "version" : "v2.0.5",
  "date" : "2018-09-14",
  "changes" : [ {
    "type" : "fix",
    "text" : "Adding to downloader via result button would always show failed (introduced with 2.0.3)"
  } ]
}, {
  "version" : "v2.0.4",
  "date" : "2018-09-13",
  "changes" : [ {
    "type" : "fix",
    "text" : "Improved feedback when adding NZBs to downloader failed"
  } ]
}, {
  "version" : "v2.0.3",
  "date" : "2018-09-05",
  "changes" : [ {
    "type" : "fix",
    "text" : "In some cases an incorrect NZB URL was used for downloads"
  }, {
    "type" : "fix",
    "text" : "Saving the config would sometimes show confusing or wrong warnings"
  }, {
    "type" : "fix",
    "text" : "Restoring from web UI had no effect"
  }, {
    "type" : "fix",
    "text" : "Category mapping would sometimes not work for incoming searches"
  } ]
}, {
  "version" : "v2.0.2",
  "date" : null,
  "changes" : [ {
    "type" : "fix",
    "text" : "Minor stability improvements"
  } ]
}, {
  "version" : "v2.0.1",
  "date" : "2018-08-19",
  "changes" : [ {
    "type" : "fix",
    "text" : "New installations would generate a faulty default configuration, resulting in failed searches"
  } ]
}, {
  "version" : "v2.0.0",
  "date" : "2018-08-18",
  "changes" : [ {
    "type" : "feature",
    "text" : "NZBHydra 2 can now run with Java 8, 9 or 10. It shouldn't matter much which version you use as long as it's up to date. If you want to use 9 or 10 you'll need to manually update the wrapper (i.e. the executable(s) in the main folder)"
  }, {
    "type" : "feature",
    "text" : "Reduced startup time. My instance starts in 8 seconds instead of 22 but YRMV"
  }, {
    "type" : "feature",
    "text" : "I updated the underlying libraries and main framework. This doesn't change much for you except that NZBHydra 2 is a bit more future proof and may have some new bugs :-)"
  }, {
    "type" : "feature",
    "text" : "Added an option to keep the history (searches, downloads, stats) only for a certain time (see Searching options). This may reduce the database size and stats calculation time and may improve performance a bit."
  }, {
    "type" : "fix",
    "text" : "Hydra will correctly recognize if run in the windows program files folder"
  }, {
    "type" : "fix",
    "text" : "When shutting down or restarting Hydra will try to defrag the database file. In some cases this should drastically reduce the database size. It may grow again but for now I don't have a better fix than restarting the instance..."
  }, {
    "type" : "fix",
    "text" : "Remove multiple trailing words from titles if found"
  } ]
}, {
  "version" : "v1.5.2",
  "date" : "2018-07-31",
  "changes" : [ {
    "type" : "fix",
    "text" : "Adding new categories resulted in an exception"
  }, {
    "type" : "note",
    "text" : "Increased the default XMX value to 256"
  } ]
}, {
  "version" : "v1.5.1",
  "date" : "2018-06-11",
  "changes" : [ {
    "type" : "fix",
    "text" : "Adding of downloaders to config was broken with last version"
  } ]
}, {
  "version" : "v1.5.0",
  "date" : "2018-06-10",
  "changes" : [ {
    "type" : "feature",
    "text" : "Redesigned the button to add new indexers. Inspired by Sonarr"
  }, {
    "type" : "feature",
    "text" : "When a torrent black hole is configured magnet links will be saved as files there. Let me know if you need a switch to disable that. Thanks to wh0cares"
  }, {
    "type" : "fix",
    "text" : "Config validation was not executed properly, sometimes allowing invalid values or even preventing the config from being changed"
  }, {
    "type" : "note",
    "text" : "Added a small note to the readme that \"linux\" releases mean any platform but windows. Renaming the releases would break updates for running instances"
  } ]
}, {
  "version" : "v1.4.18",
  "date" : "2018-05-22",
  "changes" : [ {
    "type" : "fix",
    "text" : "Previous version was missing readme.md which resulted in broken updates"
  } ]
}, {
  "version" : "v1.4.16",
  "date" : "2018-05-22",
  "changes" : [ {
    "type" : "fix",
    "text" : "Small error in API? help from last version"
  } ]
}, {
  "version" : "v1.4.15",
  "date" : "2018-05-22",
  "changes" : [ {
    "type" : "feature",
    "text" : "Support animetosho (both newznab and torznab)"
  }, {
    "type" : "feature",
    "text" : "Add small 'API?' button in config to display newznab and torznab endpoints and the api key"
  } ]
}, {
  "version" : "v1.4.14",
  "date" : "2018-05-21",
  "changes" : [ {
    "type" : "fix",
    "text" : "Error with TMDB IDs introduced with last version"
  }, {
    "type" : "note",
    "text" : "In some cases long running instances of Hydra use a lot of CPU when they should be idle. I've made some changes which should reduce the problem to a degree. Please let me know at https://github.com/theotherp/nzbhydra2/issues/96 if you have similar problems or, even better, if they've gone away with this version"
  } ]
}, {
  "version" : "v1.4.13",
  "date" : "2018-05-12",
  "changes" : [ {
    "type" : "fix",
    "text" : "Conversion of IMDB to TMDB ID failed with missing tt prefix"
  } ]
}, {
  "version" : "v1.4.12",
  "date" : "2018-05-05",
  "changes" : [ {
    "type" : "fix",
    "text" : "Prevent database error when ignoring too many updates..."
  } ]
}, {
  "version" : "v1.4.11",
  "date" : "2018-05-05",
  "changes" : [ {
    "type" : "fix",
    "text" : "Prevent rare database error when converting between movie IDs"
  }, {
    "type" : "fix",
    "text" : "Prevent API keys from leaking in debug infos ZIP when included in last error property"
  } ]
}, {
  "version" : "v1.4.10",
  "date" : "2018-05-05",
  "changes" : [ {
    "type" : "feature",
    "text" : "Option to disable download status updates. *Might* help in some rare cases where CPU usage is high when NZBHydra2 is supposed to idle"
  } ]
}, {
  "version" : "v1.4.9",
  "date" : null,
  "changes" : [ {
    "type" : "fix",
    "text" : "Log levels for console and file were not honored properly."
  } ]
}, {
  "version" : "v1.4.8",
  "date" : "2018-03-17",
  "changes" : [ {
    "type" : "note",
    "text" : "Updated the wrapper to create a memory dump file if the main process crashes when it's out of memory. As before you need to update the wrapper manually (except when you use docker and don't use the internal update mechanism). This is not strictly necessary but will improve chances of me debugging memory problems."
  } ]
}, {
  "version" : "v1.4.7",
  "date" : "2018-03-14",
  "changes" : [ {
    "type" : "fix",
    "text" : "Bug in internal logic would throw exception and cause indexers to be disabled for no reason"
  }, {
    "type" : "fix",
    "text" : "API hit limit reached on omg would disable indexer permanently"
  }, {
    "type" : "fix",
    "text" : "Indexer config state would change when switching config tabs"
  }, {
    "type" : "fix",
    "text" : "Indexer priority field was not displayed in config"
  } ]
}, {
  "version" : "v1.4.6",
  "date" : "2018-03-08",
  "changes" : [ {
    "type" : "feature",
    "text" : "Prepend words in the results filter box with ! to exclude them"
  }, {
    "type" : "fix",
    "text" : "Shift-click for selecting multiple results in a row didn't work on firefox"
  } ]
}, {
  "version" : "v1.4.5",
  "date" : "2018-03-05",
  "changes" : [ {
    "type" : "fix",
    "text" : "Improve caps check for some results using a TV show's initialism instead of the full name in the title"
  } ]
}, {
  "version" : "v1.4.4",
  "date" : "2018-02-27",
  "changes" : [ {
    "type" : "fix",
    "text" : "Handle LL searches better that request a general category and a subcategory (e.g. 7000,7020)"
  } ]
}, {
  "version" : "v1.4.3",
  "date" : "2018-02-23",
  "changes" : [ {
    "type" : "fix",
    "text" : "Migration failed because of missing datatabase table"
  } ]
}, {
  "version" : "v1.4.2",
  "date" : "2018-02-17",
  "changes" : [ {
    "type" : "fix",
    "text" : "Allow configuration of basic auth credentials for jackett"
  } ]
}, {
  "version" : "v1.4.1",
  "date" : "2018-02-13",
  "changes" : [ {
    "type" : "fix",
    "text" : "Indexers with incomplete config were shown in selection list but not actually usable"
  }, {
    "type" : "fix",
    "text" : "Some issues with indexers not beeing reenabled and some confusing messages being shown. The whole thing with indexers being disabled after errors is still a bit wonky"
  }, {
    "type" : "fix",
    "text" : "Some potential memory leaks"
  } ]
}, {
  "version" : "v1.4.0",
  "date" : "2018-02-10",
  "changes" : [ {
    "type" : "feature",
    "text" : "Rewrote the display of indexer statuses. An indexer's status is now displayed in the indexer config section (where you would probably expect it). The 'Enabled' switch was extended and now will show one of the states 'Enabled', 'Temporarily disabled', 'Permanently disabled' or 'User disabled' and an explanation. THe Indexer statuses view does still show alle the indexers' statuses but is less cluttered"
  }, {
    "type" : "feature",
    "text" : "Show search results filter box in table header because some users didn't find the filter icons"
  }, {
    "type" : "fix",
    "text" : "Prevent weird 'Unexpected error in hydra code. Sorry...'"
  } ]
}, {
  "version" : "v1.3.3",
  "date" : "2018-02-08",
  "changes" : [ {
    "type" : "feature",
    "text" : "Improve conversion of newznab categories to internal categories"
  }, {
    "type" : "fix",
    "text" : "Exception in migration when providing no database file even when migration of database was requested"
  }, {
    "type" : "feature",
    "text" : "Allow loading of UI files from local folder to allow proper development of UI"
  } ]
}, {
  "version" : "v1.3.2",
  "date" : "2018-02-05",
  "changes" : [ {
    "type" : "fix",
    "text" : "Settings file was sometimes corrupted (wrong charset) and could not be loaded anymore"
  }, {
    "type" : "fix",
    "text" : "Delete error column in indexer status page when indexer is reenabled"
  }, {
    "type" : "fix",
    "text" : "Button to browse file system for selecting torrent folder would fail on some systems (e.g. docker)"
  } ]
}, {
  "version" : "v1.3.1",
  "date" : "2018-02-04",
  "changes" : [ {
    "type" : "feature",
    "text" : "Display serious errors on windows in message box"
  }, {
    "type" : "fix",
    "text" : "Hopefully reduced chance of empty config files being written"
  }, {
    "type" : "fix",
    "text" : "Handle duplicate results from indexers better (should rarely happen)"
  }, {
    "type" : "note",
    "text" : "NZBHydra will recognize if it's running on windows and in folder like c:\\program files or c:\\program files (x86) and refuse to start. Those folders have special read/write rights which might cause some problems. I recommend putting any programs that are not installed by a setup in a \"regular\" folder"
  } ]
}, {
  "version" : "v1.3.0",
  "date" : "2018-02-03",
  "changes" : [ {
    "type" : "feature",
    "text" : "Experimental feature to use a packaged CA certs file. This probably doesn't concern you but it may solve some SSL related issues with some newer or different JREs"
  }, {
    "type" : "fix",
    "text" : "Sort indexer download shares by share"
  }, {
    "type" : "fix",
    "text" : "Made the migration process a tiny bit more robust wrt wrong input"
  }, {
    "type" : "fix",
    "text" : "Display caps check button for indexers without API key (e.g. spotweb instances). Hide button and search type and ID fields for new indexer. The check is done automatically"
  } ]
}, {
  "version" : "v1.2.6",
  "date" : "2018-02-02",
  "changes" : [ {
    "type" : "fix",
    "text" : "Sabnzbd history could not be properly parsed, preventing download status updates"
  } ]
}, {
  "version" : "v1.2.5",
  "date" : "2018-01-31",
  "changes" : [ {
    "type" : "fix",
    "text" : "Completely fix spotweb support..."
  } ]
}, {
  "version" : "v1.2.4",
  "date" : "2018-01-31",
  "changes" : [ {
    "type" : "fix",
    "text" : "Help headphones parse Hydra's results"
  }, {
    "type" : "fix",
    "text" : "Indexer connection check used empty API key parameter, preventing check to spotweb to work"
  } ]
}, {
  "version" : "v1.2.3",
  "date" : "2018-01-30",
  "changes" : [ {
    "type" : "fix",
    "text" : "Prevent session timeout"
  } ]
}, {
  "version" : "v1.2.2",
  "date" : "2018-01-29",
  "changes" : [ {
    "type" : "note",
    "text" : "I've added debug logging to the wrapper for better, well, debugging of problems related to updating. To enable debug logging create a file DEBUG in the data folder and restart the program. As before, any non-docker installations will need to update the wrapper files manually. I'm working on a better solution."
  }, {
    "type" : "fix",
    "text" : "Adding binsearch/NZBIndex/anizb would fail the connection check"
  }, {
    "type" : "fix",
    "text" : "Periodic check of downloader status was not executed as expected, resulting in incomplete status NZB reports in the history"
  }, {
    "type" : "fix",
    "text" : "Logger sometimes swallowed information when anonymizing data"
  } ]
}, {
  "version" : "v1.2.1",
  "date" : "2018-01-27",
  "changes" : [ {
    "type" : "note",
    "text" : "I've changed how some data is kept in the database. Deleting an indexer will remove it completely from the database, also deleting all related stats, search results and downloads. This might take a while on the next startup or whenever you delete an indexer with many related entries"
  }, {
    "type" : "feature",
    "text" : "Option to delete backups after x weeks. 4 is the default"
  }, {
    "type" : "fix",
    "text" : "Improve layout on mobile devices. Thanks nemchik"
  }, {
    "type" : "fix",
    "text" : "Updated the wrapper to delete older JAR files which previously caused some trouble. Any existing installations will have to update this manually. Docker containers must be updated."
  } ]
}, {
  "version" : "v1.2.0",
  "date" : "2018-01-25",
  "changes" : [ {
    "type" : "feature",
    "text" : "Send torrent magnet links to associated program"
  }, {
    "type" : "fix",
    "text" : "Results without recognizable category were rejected"
  } ]
}, {
  "version" : "v1.1.4",
  "date" : "2018-01-22",
  "changes" : [ {
    "type" : "fix",
    "text" : "Hide torrent black hole buttons for magnet links"
  }, {
    "type" : "fix",
    "text" : "Torrents were sometimes not correctly downloaded and would have extension .nzb"
  } ]
}, {
  "version" : "v1.1.3",
  "date" : "2018-01-21",
  "changes" : [ {
    "type" : "fix",
    "text" : "Fix NZB links not being constructed correctly. Sorry about that"
  } ]
}, {
  "version" : "v1.1.2",
  "date" : "2018-01-21",
  "changes" : [ {
    "type" : "feature",
    "text" : "Improved handling of XML generation for newznab/torznab API calls. Should improve compatibility with calling tools"
  }, {
    "type" : "feature",
    "text" : "Hydra attempts to recognize if it's running inside docker. It will not allow you call the internal update mechanism from the main page. You may still call it from the Updates page but a warning will be shown. Let me know if this works"
  }, {
    "type" : "fix",
    "text" : "The URL code change introduced with 1.1.0 might've caused some problems and should be fixed now"
  }, {
    "type" : "fix",
    "text" : "Sending NZBs from the download history to downloaders didn't work. You'll have to manually choose a category because the original category isn't available in the download history anymore"
  }, {
    "type" : "fix",
    "text" : "NZB filenames were not sanitized before being written to ZIP, resulting in an error"
  }, {
    "type" : "fix",
    "text" : "Improved dialog during update installation (no more error messages when everything is fine, hopefully)"
  }, {
    "type" : "fix",
    "text" : "Download history was not filterable by indexer"
  }, {
    "type" : "fix",
    "text" : "SickBeard/-rage/Medusa did not find all relevant categories. I've changed the way Hydra reports itscategories to calling tools. It follows the <a href=\"http://newznab.readthedocs.io/en/latest/misc/api/#predefined-categories\">predefined categories of the newznab standard</a>."
  } ]
}, {
  "version" : "v1.1.1",
  "date" : "2018-01-17",
  "changes" : [ {
    "type" : "fix",
    "text" : "Fix results not being recognized by SickRage"
  }, {
    "type" : "fix",
    "text" : "The URL code change introduced with 1.1.0 might've caused some problems and should be fixed now"
  } ]
}, {
  "version" : "v1.1.0",
  "date" : "2018-01-15",
  "changes" : [ {
    "type" : "feature",
    "text" : "Completely rewrote handling of scheme, port, host and context path. Should solve some issues and prevent others from happening where reverse proxies are involved. Also extended the <a href=\"https://github.com/theotherp/nzbhydra2/wiki/Exposing-Hydra-to-the-internet-and-using-reverse-proxies\">Wiki</a>. There's no need to set an external URL anymore. Please report back if this causes any issues"
  }, {
    "type" : "note",
    "text" : "I'll remove the option to send links to downloaders in one of the coming versions. Only upload of NZBs to downloaders will be supported. v2 is capable of handling it without issues and it allows for better control and upload status recognition"
  } ]
}, {
  "version" : "v1.0.18",
  "date" : "2018-01-13",
  "changes" : [ {
    "type" : "fix",
    "text" : "Remove test data left in by mistake"
  } ]
}, {
  "version" : "v1.0.17",
  "date" : "2018-01-13",
  "changes" : [ {
    "type" : "feature",
    "text" : "Don't require restart for change of log level"
  }, {
    "type" : "feature",
    "text" : "Show status updates during update"
  }, {
    "type" : "fix",
    "text" : "In some cases restarting resulted in shutdown. If you are affected by this you will to manually update the wrapper from this release"
  }, {
    "type" : "fix",
    "text" : "In some cases duplicate detection would throw an exception"
  }, {
    "type" : "feature",
    "text" : "Support JSON output for API searches"
  } ]
}, {
  "version" : "v1.0.16",
  "date" : "2018-01-11",
  "changes" : [ {
    "type" : "fix",
    "text" : "Make sure users don't enter an insane download limit value"
  }, {
    "type" : "fix",
    "text" : "Fix forbidden regexes which might've let some results through"
  }, {
    "type" : "feature",
    "text" : "Add option to disable CSRF protection and disable it by default"
  } ]
}, {
  "version" : "v1.0.15",
  "date" : "2018-01-10",
  "changes" : [ {
    "type" : "feature",
    "text" : "Pull NZB download status from configured downloaders instead of relying on extension scripts"
  }, {
    "type" : "feature",
    "text" : "Add button to check caps for all/all incomplete (yellow) indexers"
  }, {
    "type" : "fix",
    "text" : "Anonymize username:password pairs in URLs in logs"
  }, {
    "type" : "fix",
    "text" : "Torznab results were returned wrong, preventing Hydra from being added to radarr"
  } ]
}, {
  "version" : "v1.0.14",
  "date" : "2018-01-09",
  "changes" : [ {
    "type" : "fix",
    "text" : "Gracefully shutdown when restarting or quitting while search requests are handled"
  } ]
}, {
  "version" : "v1.0.13",
  "date" : "2018-01-09",
  "changes" : [ {
    "type" : "fix",
    "text" : "NZBs proxied from indexers were returned with wrong / random seeming file name"
  } ]
}, {
  "version" : "v1.0.12",
  "date" : "2018-01-07",
  "changes" : [ {
    "type" : "feature",
    "text" : "Allow migrating only the config, skipping the database migration"
  } ]
}, {
  "version" : "v1.0.11",
  "date" : "2018-01-07",
  "changes" : [ {
    "type" : "fix",
    "text" : "Fix error in auth introduced in a previous version"
  } ]
}, {
  "version" : "v1.0.10",
  "date" : "2018-01-07",
  "changes" : [ {
    "type" : "feature",
    "text" : "Improve the logging for web exceptions (which are often swallowed which makes debugging harder)"
  }, {
    "type" : "fix",
    "text" : "Name of the category would not update in the category dropdown box on the search page"
  }, {
    "type" : "fix",
    "text" : "Allow searching without a query in the UI"
  } ]
}, {
  "version" : "v1.0.9",
  "date" : "2018-01-07",
  "changes" : [ {
    "type" : "fix",
    "text" : "Allow NZBHydra2 to be shown in an iFrame (e.g. organizr)"
  } ]
}, {
  "version" : "v1.0.8",
  "date" : "2018-01-06",
  "changes" : [ {
    "type" : "fix",
    "text" : "Increase lengths for columns which may contain very long texts (errors, queries)"
  } ]
}, {
  "version" : "v1.0.7",
  "date" : "2018-01-06",
  "changes" : [ {
    "type" : "fix",
    "text" : "Fix bug in wrapper that I introduced in last version. Oh well..."
  } ]
}, {
  "version" : "v1.0.6",
  "date" : "2018-01-06",
  "changes" : [ {
    "type" : "note",
    "text" : "Improve the way the host is determined. External URL should not need to be set when not using a reverse proxy"
  }, {
    "type" : "note",
    "text" : "Remove PyYAML dependency from wrapper"
  } ]
}, {
  "version" : "v1.0.5",
  "date" : "2018-01-06",
  "changes" : [ {
    "type" : "note",
    "text" : "Make migration a bit more stable"
  }, {
    "type" : "note",
    "text" : "Make sure wrapper is started from correct folder"
  } ]
}, {
  "version" : "v1.0.4",
  "date" : "2018-01-06",
  "changes" : [ {
    "type" : "note",
    "text" : "So many fixes"
  } ]
}, {
  "version" : "v1.0.3",
  "date" : "2018-01-06",
  "changes" : [ {
    "type" : "note",
    "text" : "So many fixes"
  } ]
}, {
  "version" : "v1.0.2",
  "date" : "2018-01-06",
  "changes" : [ {
    "type" : "note",
    "text" : "First public release. Welcome!"
  } ]
} ]