[
  {
    "version": "v2.3.3",
    "changes": [
      {
        "type": "fix",
        "text": "Connection to hosts like 'sabnzd' would fail"
      }
    ]
  },
  {
    "version": "v2.3.2",
    "changes": [
      {
        "type": "fix",
        "text": "2.3.1 didn't start for users updating from 2.2.5 to 2.3.1. Fuck this shit"
      }
    ]
  },
  {
    "version": "v2.3.1",
    "changes": [
      {
        "type": "fix",
        "text": "2.2.5 unfortunately may have caused database corruption in some cases. Hopefully no more... The fix may need some time the first time this new version is started."
      }
    ]
  },
  {
    "version": "v2.3.0",
    "changes": [
      {
        "type": "feature",
        "text": "Java 11 is now supported. This required an update of the internal framework which might have some unforseen side effects (bugs), especially regarding authentification and handling of reverse proxies. Let me know if something doesn't work as expected."
      },
      {
        "type": "feature",
        "text": "Rename searching option 'Ignore temporarily disabled' to 'Ignore temporary errors'. If enabled indexers will not be temporarily disabled at all if a recoverable error occurs."
      },
      {
        "type": "fix",
        "text": "Opening magnet links under Windows 7 doesn't require administrator rights anymore."
      }
    ]
  },
  {
    "version": "v2.2.5",
    "changes": [
      {
        "type": "fix",
        "text": "In some cases (with really big databases) the check of the API hit limit could take very long. This was hopefully improved. Migration to this version might take a bit for such instances."
      }
    ]
  },
  {
    "version": "v2.2.4",
    "changes": [
      {
        "type": "feature",
        "text": "Add indexer specific limit to caps check. Background: RARBG only allows one request every two seconds so the caps check, which until now used two concurrent threads and a delay of 1 second, would result in errors. The limits are hard coded. Hydra will not attempt to do any rate limiting for regular search requests."
      }
    ]
  },
  {
    "version": "v2.2.3",
    "changes": [
      {
        "type": "feature",
        "text": "Include database metadata in debug infos"
      }
    ]
  },
  {
    "version": "v2.2.2",
    "changes": [
      {
        "type": "feature",
        "text": "Minor improvements to performance logging"
      }
    ]
  },
  {
    "version": "v2.2.1",
    "changes": [
      {
        "type": "feature",
        "text": "Improve logging of unparseable indexer responses"
      }
    ]
  },
  {
    "version": "v2.2.0",
    "changes": [
      {
        "type": "note",
        "text": "This release brings some major changes regarding categories and the handling of newznab categories. Please let me know if it breaks anything or has unexpected side effects (or if you love what I've done ;-))"
      },
      {
        "type": "feature",
        "text": "Allow combinations of newznab categories which must all be found in a search result for that category to be applied. For example 4090&11000 will only match items with both 4090 and 11000. This should allow for even finer category tuning with trackers accessed via Jackett."
      },
      {
        "type": "feature",
        "text": "Replace newznab categories incoming API searches with newznab categories of mapped category. For example when you have 2040,2050 configured for Movies HD and a search comes in using 2040 then indexers will be queried using 2040,2050. Until now only the supplied category was used (2040 in the example). This should result in more results to be found and so far I can't tell if it will return just better results or more crap. You can disable this with the 'Transform newznab categories' setting in the searching config."
      },
      {
        "type": "feature",
        "text": "Related to above: The categories on the caps page are created from the configured categories. To keep this clean only one newznab category will be used for every category (e.g. Movies HD using 2040,2050 will only be included once with 2040 as ID."
      },
      {
        "type": "fix",
        "text": "Use dereferer for NZB details site"
      }
    ]
  },
  {
    "version": "v2.1.7",
    "changes": [
      {
        "type": "fix",
        "text": "Fix/improve category mapping introduced in 2.1.6. Use custom newznab categories if none from the predefined range are provided."
      }
    ]
  },
  {
    "version": "v2.1.6",
    "changes": [
      {
        "type": "fix",
        "text": "When uploading a backup file the UI didn't update to inform the user about the progress after the file was uploaded."
      },
      {
        "type": "fix",
        "text": "Improve category mapping for (torznab) indexers. Some use custom newznab category numbers (>9999) which could not be properly mapped to preconfigured categories."
      }
    ]
  },
  {
    "version": "v2.1.5",
    "changes": [
      {
        "type": "fix",
        "text": "Improve handling of movie and tv searches with some indexers (see v2.0.23). I just wish all indexers could work the same... :-/"
      },
      {
        "type": "fix",
        "text": "Prevent indexers without caps from being caps checked (NZBIndex, Binsearch)"
      },
      {
        "type": "fix",
        "text": "Improve wording indexer state when disabled by the system due to an error from which it cannot recover automatically"
      }
    ]
  },
  {
    "version": "v2.1.4",
    "changes": [
      {
        "type": "feature",
        "text": "Allow retrieval of history and stats via API. See https://github.com/theotherp/nzbhydra2/wiki/External-API,-RSS-and-cached-queries"
      },
      {
        "type": "fix",
        "text": "Repeat of searches from history sometimes used wrong parameters"
      },
      {
        "type": "fix",
        "text": "Added nzbs.org to list of indexers unable to process type searches without IDs"
      }
    ]
  },
  {
    "version": "v2.1.3",
    "changes": [
      {
        "type": "fix",
        "text": "Removed dead indexers from presets"
      },
      {
        "type": "fix",
        "text": "Prevent exception related to duplicate TV infos in database"
      }
    ]
  },
  {
    "version": "v2.1.2",
    "changes": [
      {
        "type": "fix",
        "text": "Indexer added as newznab indexer even when selected as torznab in the config GUI"
      }
    ]
  },
  {
    "version": "v2.1.1",
    "changes": [
      {
        "type": "fix",
        "text": "Validate config to prevent indexers with duplicate names"
      },
      {
        "type": "fix",
        "text": "Validate config to prevent torznab indexers being added as newznab indexer and vice versa"
      }
    ]
  },
  {
    "version": "v2.1.0",
    "changes": [
      {
        "type": "fix",
        "text": "Search query was not built properly when conversion of search IDs did not provide any IDs usable by an indexer"
      },
      {
        "type": "feature",
        "text": "Support API caps in JSON"
      }
    ]
  },
  {
    "version": "v2.0.24",
    "changes": [
      {
        "type": "note",
        "text": "Added NZBGeek to the list mentioned in v2.0.23. Thanks to the user letting me know about it."
      }
    ]
  },
  {
    "version": "v2.0.23",
    "changes": [
      {
        "type": "note",
        "text": "Previously when an API call with search type 'movie' or 'tvsearch' was made without any identifiers or category I would call indexers with search type 'search' instead because some indexers don't like that. This causes some other problems so I've reverted that behavior except for a certain list of indexers. I have hardcoded list of indexers for which the switch will be done. I'm not sure which indexers actually behave that way. So if you find an indexer where browsing the movie or TV releases (e.g. using NZB360) will return a lot of crap please let me know so I can add the indexer to the list."
      },
      {
        "type": "note",
        "text": "I've changed the java runtime that is used in the docker container maintained by me (although I actually don't want to really support that...). In my tests it nearly halved memory usage in some scenarios (199MB compared to 380MB). If this proves to be stable I'll recommend the other maintainers to use this as well."
      }
    ]
  },
  {
    "version": "v2.0.22",
    "changes": [
      {
        "type": "fix",
        "text": "Upload of large ZIP files for restoration was disabled"
      }
    ]
  },
  {
    "version": "v2.0.21",
    "changes": [
      {
        "type": "feature",
        "text": "Some users have reported corrupted config files. I can't explain how that could ever happen but I've added code that tries to recognize this on startuppu and attempts to repair it automatically"
      },
      {
        "type": "fix",
        "text": "New instances were not properly initialized, in some instances resulting in a crash on startup. Sorry about that"
      }
    ]
  },
  {
    "version": "v2.0.20",
    "changes": [
      {
        "type": "feature",
        "text": "Make sure existing configuration or database is not loaded by an older version of a program than it was created with"
      }
    ]
  },
  {
    "version": "v2.0.19",
    "changes": [
      {
        "type": "fix",
        "text": "Restoration from uploaded backup file wouldn't work"
      }
    ]
  },
  {
    "version": "v2.0.18",
    "changes": [
      {
        "type": "fix",
        "text": "Details link was hidden even if not restricted by auth config"
      },
      {
        "type": "fix",
        "text": "Redirects to torrent magnet links are now recognized and properly handled"
      },
      {
        "type": "fix",
        "text": "Downloads of NZBs with spaces in the filename are now properly handled"
      },
      {
        "type": "fix",
        "text": "Suffix NZBs sent to sabnzbd with .nzb to increase compatibility with newsbin"
      }
    ]
  },
  {
    "version": "v2.0.17",
    "changes": [
      {
        "type": "feature",
        "text": "Automatic update. This feature has been requested for ages. Ironically, now that I rarely release new versions I've finally implemented it. It's opt-in for now even though the update process has been really stable for a while. Now that the startup is faster Hydra shouldn't be unavailable during the update process for more than 20 seconds or so. Any tools calling during that time should recover fine."
      },
      {
        "type": "fix",
        "text": "Make sure to load resources from TVMaze using HTTPS"
      },
      {
        "type": "fix",
        "text": "Handle (invalid) spaces in URLs"
      }
    ]
  },
  {
    "version": "v2.0.16",
    "changes": [
      {
        "type": "fix",
        "text": "Size tag was not forwarded from torznab results"
      }
    ]
  },
  {
    "version": "v2.0.15",
    "changes": [
      {
        "type": "fix",
        "text": "ID lookup for TV shows didn't always work"
      }
    ]
  },
  {
    "version": "v2.0.14",
    "changes": [
      {
        "type": "note",
        "text": "The URL base has to start with a / from now on. Configs without URL base will be migrated"
      },
      {
        "type": "fix",
        "text": "ID based TV search from GUI would sometimes ignore ID"
      }
    ]
  },
  {
    "version": "v2.0.13",
    "changes": [
      {
        "type": "feature",
        "text": "Warn when changing the host to an invalid IP"
      },
      {
        "type": "fix",
        "text": "api.althub.co.za should hopefully actually work now"
      }
    ]
  },
  {
    "version": "v2.0.12",
    "changes": [
      {
        "type": "fix",
        "text": "SSL error when accessing althub from docker. Should be fixed with the setting to use the packaged cacerts file enabled"
      },
      {
        "type": "fix",
        "text": "Detection and handling of required restart after changing config was broken"
      }
    ]
  },
  {
    "version": "v2.0.11",
    "changes": [
      {
        "type": "feature",
        "text": "Allow to disable SSL verification only for certain hosts"
      },
      {
        "type": "feature",
        "text": "Warn when host is changed from 0.0.0.0 and run in docker. This seems to cause some problems"
      }
    ]
  },
  {
    "version": "v2.0.10",
    "changes": [
      {
        "type": "fix",
        "text": "Sometimes search IDs would be used even if the indexer wasn't configured to use them, resulting in failing searches"
      }
    ]
  },
  {
    "version": "v2.0.9",
    "changes": [
      {
        "type": "fix",
        "text": "Caps check with Jackett indexers wouldn't complete properly due to a change in their code"
      }
    ]
  },
  {
    "version": "v2.0.8",
    "changes": [
      {
        "type": "fix",
        "text": "Adapt database to store long torrent magnet links"
      }
    ]
  },
  {
    "version": "v2.0.7",
    "changes": [
      {
        "type": "fix",
        "text": "Sabnzbd API key was not migrated"
      }
    ]
  },
  {
    "version": "v2.0.6",
    "changes": [
      {
        "type": "fix",
        "text": "Torznab queries were limited to 100 results. I've removed the limit altogether. As torznab doesn't require or support paging there's no reason for a request limit"
      }
    ]
  },
  {
    "version": "v2.0.5",
    "changes": [
      {
        "type": "fix",
        "text": "Adding to downloader via result button would always show failed (introduced with 2.0.3)"
      }
    ]
  },
  {
    "version": "v2.0.4",
    "changes": [
      {
        "type": "fix",
        "text": "Improved feedback when adding NZBs to downloader failed"
      }
    ]
  },
  {
    "version": "v2.0.3",
    "changes": [
      {
        "type": "fix",
        "text": "In some cases an incorrect NZB URL was used for downloads"
      },
      {
        "type": "fix",
        "text": "Saving the config would sometimes show confusing or wrong warnings"
      },
      {
        "type": "fix",
        "text": "Restoring from web UI had no effect"
      },
      {
        "type": "fix",
        "text": "Category mapping would sometimes not work for incoming searches"
      }
    ]
  },
  {
    "version": "v2.0.2",
    "changes": [
      {
        "type": "fix",
        "text": "Minor stability improvements"
      }
    ]
  },
  {
    "version": "v2.0.1",
    "changes": [
      {
        "type": "fix",
        "text": "New installations would generate a faulty default configuration, resulting in failed searches"
      }
    ]
  },
  {
    "version": "v2.0.0",
    "changes": [
      {
        "type": "feature",
        "text": "NZBHydra 2 can now run with Java 8, 9 or 10. It shouldn't matter much which version you use as long as it's up to date. If you want to use 9 or 10 you'll need to manually update the wrapper (i.e. the executable(s) in the main folder)"
      },
      {
        "type": "feature",
        "text": "Reduced startup time. My instance starts in 8 seconds instead of 22 but YRMV"
      },
      {
        "type": "feature",
        "text": "I updated the underlying libraries and main framework. This doesn't change much for you except that NZBHydra 2 is a bit more future proof and may have some new bugs :-)"
      },
      {
        "type": "feature",
        "text": "Added an option to keep the history (searches, downloads, stats) only for a certain time (see Searching options). This may reduce the database size and stats calculation time and may improve performance a bit."
      },
      {
        "type": "fix",
        "text": "Hydra will correctly recognize if run in the windows program files folder"
      },
      {
        "type": "fix",
        "text": "When shutting down or restarting Hydra will try to defrag the database file. In some cases this should drastically reduce the database size. It may grow again but for now I don't have a better fix than restarting the instance..."
      },
      {
        "type": "fix",
        "text": "Remove multiple trailing words from titles if found"
      }
    ]
  },
  {
    "version": "v1.5.2",
    "changes": [
      {
        "type": "fix",
        "text": "Adding new categories resulted in an exception"
      },
      {
        "type": "note",
        "text": "Increased the default XMX value to 256"
      }
    ]
  },
  {
    "version": "v1.5.1",
    "changes": [
      {
        "type": "fix",
        "text": "Adding of downloaders to config was broken with last version"
      }
    ]
  },
  {
    "version": "v1.5.0",
    "changes": [
      {
        "type": "feature",
        "text": "Redesigned the button to add new indexers. Inspired by Sonarr"
      },
      {
        "type": "feature",
        "text": "When a torrent black hole is configured magnet links will be saved as files there. Let me know if you need a switch to disable that. Thanks to wh0cares"
      },
      {
        "type": "fix",
        "text": "Config validation was not executed properly, sometimes allowing invalid values or even preventing the config from being changed"
      },
      {
        "type": "note",
        "text": "Added a small note to the readme that \"linux\" releases mean any platform but windows. Renaming the releases would break updates for running instances"
      }
    ]
  },
  {
    "version": "v1.4.18",
    "changes": [
      {
        "type": "fix",
        "text": "Previous version was missing readme.md which resulted in broken updates"
      }
    ]
  },
  {
    "version": "v1.4.16",
    "changes": [
      {
        "type": "fix",
        "text": "Small error in API? help from last version"
      }
    ]
  },
  {
    "version": "v1.4.15",
    "changes": [
      {
        "type": "feature",
        "text": "Support animetosho (both newznab and torznab)"
      },
      {
        "type": "feature",
        "text": "Add small 'API?' button in config to display newznab and torznab endpoints and the api key"
      }
    ]
  },
  {
    "version": "v1.4.14",
    "changes": [
      {
        "type": "fix",
        "text": "Error with TMDB IDs introduced with last version"
      },
      {
        "type": "note",
        "text": "In some cases long running instances of Hydra use a lot of CPU when they should be idle. I've made some changes which should reduce the problem to a degree. Please let me know at https://github.com/theotherp/nzbhydra2/issues/96 if you have similar problems or, even better, if they've gone away with this version"
      }
    ]
  },
  {
    "version": "v1.4.13",
    "changes": [
      {
        "type": "fix",
        "text": "Conversion of IMDB to TMDB ID failed with missing tt prefix"
      }
    ]
  },
  {
    "version": "v1.4.12",
    "changes": [
      {
        "type": "fix",
        "text": "Prevent database error when ignoring too many updates..."
      }
    ]
  },
  {
    "version": "v1.4.11",
    "changes": [
      {
        "type": "fix",
        "text": "Prevent rare database error when converting between movie IDs"
      },
      {
        "type": "fix",
        "text": "Prevent API keys from leaking in debug infos ZIP when included in last error property"
      }
    ]
  },
  {
    "version": "v1.4.10",
    "changes": [
      {
        "type": "feature",
        "text": "Option to disable download status updates. *Might* help in some rare cases where CPU usage is high when NZBHydra2 is supposed to idle"
      }
    ]
  },
  {
    "version": "v1.4.9",
    "changes": [
      {
        "type": "fix",
        "text": "Log levels for console and file were not honored properly."
      }
    ]
  },
  {
    "version": "v1.4.8",
    "changes": [
      {
        "type": "note",
        "text": "Updated the wrapper to create a memory dump file if the main process crashes when it's out of memory. As before you need to update the wrapper manually (except when you use docker and don't use the internal update mechanism). This is not strictly necessary but will improve chances of me debugging memory problems."
      }
    ]
  },
  {
    "version": "v1.4.7",
    "changes": [
      {
        "type": "fix",
        "text": "Bug in internal logic would throw exception and cause indexers to be disabled for no reason"
      },
      {
        "type": "fix",
        "text": "API hit limit reached on omg would disable indexer permanently"
      },
      {
        "type": "fix",
        "text": "Indexer config state would change when switching config tabs"
      },
      {
        "type": "fix",
        "text": "Indexer priority field was not displayed in config"
      }
    ]
  },
  {
    "version": "v1.4.6",
    "changes": [
      {
        "type": "feature",
        "text": "Prepend words in the results filter box with ! to exclude them"
      },
      {
        "type": "fix",
        "text": "Shift-click for selecting multiple results in a row didn't work on firefox"
      }
    ]
  },
  {
    "version": "v1.4.5",
    "changes": [
      {
        "type": "fix",
        "text": "Improve caps check for some results using a TV show's initialism instead of the full name in the title"
      }
    ]
  },
  {
    "version": "v1.4.4",
    "changes": [
      {
        "type": "fix",
        "text": "Handle LL searches better that request a general category and a subcategory (e.g. 7000,7020)"
      }
    ]
  },
  {
    "version": "v1.4.3",
    "changes": [
      {
        "type": "fix",
        "text": "Migration failed because of missing datatabase table"
      }
    ]
  },
  {
    "version": "v1.4.2",
    "changes": [
      {
        "type": "fix",
        "text": "Allow configuration of basic auth credentials for jackett"
      }
    ]
  },
  {
    "version": "v1.4.1",
    "changes": [
      {
        "type": "fix",
        "text": "Indexers with incomplete config were shown in selection list but not actually usable"
      },
      {
        "type": "fix",
        "text": "Some issues with indexers not beeing reenabled and some confusing messages being shown. The whole thing with indexers being disabled after errors is still a bit wonky"
      },
      {
        "type": "fix",
        "text": "Some potential memory leaks"
      }
    ]
  },
  {
    "version": "v1.4.0",
    "changes": [
      {
        "type": "feature",
        "text": "Rewrote the display of indexer statuses. An indexer's status is now displayed in the indexer config section (where you would probably expect it). The 'Enabled' switch was extended and now will show one of the states 'Enabled', 'Temporarily disabled', 'Permanently disabled' or 'User disabled' and an explanation. THe Indexer statuses view does still show alle the indexers' statuses but is less cluttered"
      },
      {
        "type": "feature",
        "text": "Show search results filter box in table header because some users didn't find the filter icons"
      },
      {
        "type": "fix",
        "text": "Prevent weird 'Unexpected error in hydra code. Sorry...'"
      }
    ]
  },
  {
    "version": "v1.3.3",
    "changes": [
      {
        "type": "feature",
        "text": "Improve conversion of newznab categories to internal categories"
      },
      {
        "type": "fix",
        "text": "Exception in migration when providing no database file even when migration of database was requested"
      },
      {
        "type": "feature",
        "text": "Allow loading of UI files from local folder to allow proper development of UI"
      }
    ]
  },
  {
    "version": "v1.3.2",
    "changes": [
      {
        "type": "fix",
        "text": "Settings file was sometimes corrupted (wrong charset) and could not be loaded anymore"
      },
      {
        "type": "fix",
        "text": "Delete error column in indexer status page when indexer is reenabled"
      },
      {
        "type": "fix",
        "text": "Button to browse file system for selecting torrent folder would fail on some systems (e.g. docker)"
      }
    ]
  },
  {
    "version": "v1.3.1",
    "changes": [
      {
        "type": "feature",
        "text": "Display serious errors on windows in message box"
      },
      {
        "type": "fix",
        "text": "Hopefully reduced chance of empty config files being written"
      },
      {
        "type": "fix",
        "text": "Handle duplicate results from indexers better (should rarely happen)"
      },
      {
        "type": "note",
        "text": "NZBHydra will recognize if it's running on windows and in folder like c:\\program files or c:\\program files (x86) and refuse to start. Those folders have special read/write rights which might cause some problems. I recommend putting any programs that are not installed by a setup in a \"regular\" folder"
      }
    ]
  },
  {
    "version": "v1.3.0",
    "changes": [
      {
        "type": "feature",
        "text": "Experimental feature to use a packaged CA certs file. This probably doesn't concern you but it may solve some SSL related issues with some newer or different JREs"
      },
      {
        "type": "fix",
        "text": "Sort indexer download shares by share"
      },
      {
        "type": "fix",
        "text": "Made the migration process a tiny bit more robust wrt wrong input"
      },
      {
        "type": "fix",
        "text": "Display caps check button for indexers without API key (e.g. spotweb instances). Hide button and search type and ID fields for new indexer. The check is done automatically"
      }
    ]
  },
  {
    "version": "v1.2.6",
    "changes": [
      {
        "type": "fix",
        "text": "Sabnzbd history could not be properly parsed, preventing download status updates"
      }
    ]
  },
  {
    "version": "v1.2.5",
    "changes": [
      {
        "type": "fix",
        "text": "Completely fix spotweb support..."
      }
    ]
  },
  {
    "version": "v1.2.4",
    "changes": [
      {
        "type": "fix",
        "text": "Help headphones parse Hydra's results"
      },
      {
        "type": "fix",
        "text": "Indexer connection check used empty API key parameter, preventing check to spotweb to work"
      }
    ]
  },
  {
    "version": "v1.2.3",
    "changes": [
      {
        "type": "fix",
        "text": "Prevent session timeout"
      }
    ]
  },
  {
    "version": "v1.2.2",
    "changes": [
      {
        "type": "note",
        "text": "I've added debug logging to the wrapper for better, well, debugging of problems related to updating. To enable debug logging create a file DEBUG in the data folder and restart the program. As before, any non-docker installations will need to update the wrapper files manually. I'm working on a better solution."
      },
      {
        "type": "fix",
        "text": "Adding binsearch/NZBIndex/anizb would fail the connection check"
      },
      {
        "type": "fix",
        "text": "Periodic check of downloader status was not executed as expected, resulting in incomplete status NZB reports in the history"
      },
      {
        "type": "fix",
        "text": "Logger sometimes swallowed information when anonymizing data"
      }
    ]
  },
  {
    "version": "v1.2.1",
    "changes": [
      {
        "type": "note",
        "text": "I've changed how some data is kept in the database. Deleting an indexer will remove it completely from the database, also deleting all related stats, search results and downloads. This might take a while on the next startup or whenever you delete an indexer with many related entries"
      },
      {
        "type": "feature",
        "text": "Option to delete backups after x weeks. 4 is the default"
      },
      {
        "type": "fix",
        "text": "Improve layout on mobile devices. Thanks nemchik"
      },
      {
        "type": "fix",
        "text": "Updated the wrapper to delete older JAR files which previously caused some trouble. Any existing installations will have to update this manually. Docker containers must be updated."
      }
    ]
  },
  {
    "version": "v1.2.0",
    "changes": [
      {
        "type": "feature",
        "text": "Send torrent magnet links to associated program"
      },
      {
        "type": "fix",
        "text": "Results without recognizable category were rejected"
      }
    ]
  },
  {
    "version": "v1.1.4",
    "changes": [
      {
        "type": "fix",
        "text": "Hide torrent black hole buttons for magnet links"
      },
      {
        "type": "fix",
        "text": "Torrents were sometimes not correctly downloaded and would have extension .nzb"
      }
    ]
  },
  {
    "version": "v1.1.3",
    "changes": [
      {
        "type": "fix",
        "text": "Fix NZB links not being constructed correctly. Sorry about that"
      }
    ]
  },
  {
    "version": "v1.1.2",
    "changes": [
      {
        "type": "feature",
        "text": "Improved handling of XML generation for newznab/torznab API calls. Should improve compatibility with calling tools"
      },
      {
        "type": "feature",
        "text": "Hydra attempts to recognize if it's running inside docker. It will not allow you call the internal update mechanism from the main page. You may still call it from the Updates page but a warning will be shown. Let me know if this works"
      },
      {
        "type": "fix",
        "text": "The URL code change introduced with 1.1.0 might've caused some problems and should be fixed now"
      },
      {
        "type": "fix",
        "text": "Sending NZBs from the download history to downloaders didn't work. You'll have to manually choose a category because the original category isn't available in the download history anymore"
      },
      {
        "type": "fix",
        "text": "NZB filenames were not sanitized before being written to ZIP, resulting in an error"
      },
      {
        "type": "fix",
        "text": "Improved dialog during update installation (no more error messages when everything is fine, hopefully)"
      },
      {
        "type": "fix",
        "text": "Download history was not filterable by indexer"
      },
      {
        "type": "fix",
        "text": "SickBeard/-rage/Medusa did not find all relevant categories. I've changed the way Hydra reports itscategories to calling tools. It follows the <a href=\"http://newznab.readthedocs.io/en/latest/misc/api/#predefined-categories\">predefined categories of the newznab standard</a>."
      }
    ]
  },
  {
    "version": "v1.1.1",
    "changes": [
      {
        "type": "fix",
        "text": "Fix results not being recognized by SickRage"
      },
      {
        "type": "fix",
        "text": "The URL code change introduced with 1.1.0 might've caused some problems and should be fixed now"
      }
    ]
  },
  {
    "version": "v1.1.0",
    "changes": [
      {
        "type": "feature",
        "text": "Completely rewrote handling of scheme, port, host and context path. Should solve some issues and prevent others from happening where reverse proxies are involved. Also extended the <a href=\"https://github.com/theotherp/nzbhydra2/wiki/Exposing-Hydra-to-the-internet-and-using-reverse-proxies\">Wiki</a>. There's no need to set an external URL anymore. Please report back if this causes any issues"
      },
      {
        "type": "note",
        "text": "I'll remove the option to send links to downloaders in one of the coming versions. Only upload of NZBs to downloaders will be supported. v2 is capable of handling it without issues and it allows for better control and upload status recognition"
      }
    ]
  },
  {
    "version": "v1.0.18",
    "changes": [
      {
        "type": "fix",
        "text": "Remove test data left in by mistake"
      }
    ]
  },
  {
    "version": "v1.0.17",
    "changes": [
      {
        "type": "feature",
        "text": "Don't require restart for change of log level"
      },
      {
        "type": "feature",
        "text": "Show status updates during update"
      },
      {
        "type": "fix",
        "text": "In some cases restarting resulted in shutdown. If you are affected by this you will to manually update the wrapper from this release"
      },
      {
        "type": "fix",
        "text": "In some cases duplicate detection would throw an exception"
      },
      {
        "type": "feature",
        "text": "Support JSON output for API searches"
      }
    ]
  },
  {
    "version": "v1.0.16",
    "changes": [
      {
        "type": "fix",
        "text": "Make sure users don't enter an insane download limit value"
      },
      {
        "type": "fix",
        "text": "Fix forbidden regexes which might've let some results through"
      },
      {
        "type": "feature",
        "text": "Add option to disable CSRF protection and disable it by default"
      }
    ]
  },
  {
    "version": "v1.0.15",
    "changes": [
      {
        "type": "feature",
        "text": "Pull NZB download status from configured downloaders instead of relying on extension scripts"
      },
      {
        "type": "feature",
        "text": "Add button to check caps for all/all incomplete (yellow) indexers"
      },
      {
        "type": "fix",
        "text": "Anonymize username:password pairs in URLs in logs"
      },
      {
        "type": "fix",
        "text": "Torznab results were returned wrong, preventing Hydra from being added to radarr"
      }
    ]
  },
  {
    "version": "v1.0.14",
    "changes": [
      {
        "type": "fix",
        "text": "Gracefully shutdown when restarting or quitting while search requests are handled"
      }
    ]
  },
  {
    "version": "v1.0.13",
    "changes": [
      {
        "type": "fix",
        "text": "NZBs proxied from indexers were returned with wrong / random seeming file name"
      }
    ]
  },
  {
    "version": "v1.0.12",
    "changes": [
      {
        "type": "feature",
        "text": "Allow migrating only the config, skipping the database migration"
      }
    ]
  },
  {
    "version": "v1.0.11",
    "changes": [
      {
        "type": "fix",
        "text": "Fix error in auth introduced in a previous version"
      }
    ]
  },
  {
    "version": "v1.0.10",
    "changes": [
      {
        "type": "feature",
        "text": "Improve the logging for web exceptions (which are often swallowed which makes debugging harder)"
      },
      {
        "type": "fix",
        "text": "Name of the category would not update in the category dropdown box on the search page"
      },
      {
        "type": "fix",
        "text": "Allow searching without a query in the UI"
      }
    ]
  },
  {
    "version": "v1.0.9",
    "changes": [
      {
        "type": "fix",
        "text": "Allow NZBHydra2 to be shown in an iFrame (e.g. organizr)"
      }
    ]
  },
  {
    "version": "v1.0.8",
    "changes": [
      {
        "type": "fix",
        "text": "Increase lengths for columns which may contain very long texts (errors, queries)"
      }
    ]
  },
  {
    "version": "v1.0.7",
    "changes": [
      {
        "type": "fix",
        "text": "Fix bug in wrapper that I introduced in last version. Oh well..."
      }
    ]
  },
  {
    "version": "v1.0.6",
    "changes": [
      {
        "type": "note",
        "text": "Improve the way the host is determined. External URL should not need to be set when not using a reverse proxy"
      },
      {
        "type": "note",
        "text": "Remove PyYAML dependency from wrapper"
      }
    ]
  },
  {
    "version": "v1.0.5",
    "changes": [
      {
        "type": "note",
        "text": "Make migration a bit more stable"
      },
      {
        "type": "note",
        "text": "Make sure wrapper is started from correct folder"
      }
    ]
  },
  {
    "version": "v1.0.4",
    "changes": [
      {
        "type": "note",
        "text": "So many fixes"
      }
    ]
  },
  {
    "version": "v1.0.3",
    "changes": [
      {
        "type": "note",
        "text": "So many fixes"
      }
    ]
  },
  {
    "version": "v1.0.2",
    "changes": [
      {
        "type": "note",
        "text": "First public release. Welcome!"
      }
    ]
  }
]
