[
  {
    "version": "v1.2.2",
    "changes": [
      {
        "type": "fix",
        "text": "Adding binsearch/NZBIndex/anizb would fail the connection check"
      },
      {
        "type": "fix",
        "text": "Periodic check of downloader status was not executed as expected, resulting in incomplete status NZB reports in the history"
      }
    ]
  },
  {
    "version": "v1.2.1",
    "changes": [
      {
        "type": "note",
        "text": "I've changed how some data is kept in the database. Deleting an indexer will remove it completely from the database, also deleting all related stats, search results and downloads. This might take a while on the next startup or whenever you delete an indexer with many related entries"
      },
      {
        "type": "feature",
        "text": "Option to delete backups after x weeks. 4 is the default"
      },
      {
        "type": "fix",
        "text": "Improve layout on mobile devices. Thanks nemchik"
      },
      {
        "type": "fix",
        "text": "Updated the wrapper to delete older JAR files which previously caused some trouble. Any existing installations will have to update this manually. Docker containers must be updated."
      }
    ]
  },
  {
    "version": "v1.2.0",
    "changes": [
      {
        "type": "feature",
        "text": "Send torrent magnet links to associated program"
      },
      {
        "type": "fix",
        "text": "Results without recognizable category were rejected"
      }
    ]
  },
  {
    "version": "v1.1.4",
    "changes": [
      {
        "type": "fix",
        "text": "Hide torrent black hole buttons for magnet links"
      },
      {
        "type": "fix",
        "text": "Torrents were sometimes not correctly downloaded and would have extension .nzb"
      }
    ]
  },
  {
    "version": "v1.1.3",
    "changes": [
      {
        "type": "fix",
        "text": "Fix NZB links not being constructed correctly. Sorry about that"
      }
    ]
  },
  {
    "version": "v1.1.2",
    "changes": [
      {
        "type": "feature",
        "text": "Improved handling of XML generation for newznab/torznab API calls. Should improve compatibility with calling tools"
      },
      {
        "type": "feature",
        "text": "Hydra attempts to recognize if it's running inside docker. It will not allow you call the internal update mechanism from the main page. You may still call it from the Updates page but a warning will be shown. Let me know if this works"
      },
      {
        "type": "fix",
        "text": "The URL code change introduced with 1.1.0 might've caused some problems and should be fixed now"
      },
      {
        "type": "fix",
        "text": "Sending NZBs from the download history to downloaders didn't work. You'll have to manually choose a category because the original category isn't available in the download history anymore"
      },
      {
        "type": "fix",
        "text": "NZB filenames were not sanitized before being written to ZIP, resulting in an error"
      },
      {
        "type": "fix",
        "text": "Improved dialog during update installation (no more error messages when everything is fine, hopefully)"
      },
      {
        "type": "fix",
        "text": "Download history was not filterable by indexer"
      },
      {
        "type": "fix",
        "text": "SickBeard/-rage/Medusa did not find all relevant categories. I've changed the way Hydra reports itscategories to calling tools. It follows the <a href=\"http://newznab.readthedocs.io/en/latest/misc/api/#predefined-categories\">predefined categories of the newznab standard</a>."
      }
    ]
  },
  {
    "version": "v1.1.1",
    "changes": [
      {
        "type": "fix",
        "text": "Fix results not being recognized by SickRage"
      },
      {
        "type": "fix",
        "text": "The URL code change introduced with 1.1.0 might've caused some problems and should be fixed now"
      }
    ]
  },
  {
    "version": "v1.1.0",
    "changes": [
      {
        "type": "feature",
        "text": "Completely rewrote handling of scheme, port, host and context path. Should solve some issues and prevent others from happening where reverse proxies are involved. Also extended the <a href=\"https://github.com/theotherp/nzbhydra2/wiki/Exposing-Hydra-to-the-internet-and-using-reverse-proxies\">Wiki</a>. There's no need to set an external URL anymore. Please report back if this causes any issues"
      },
      {
        "type": "note",
        "text": "I'll remove the option to send links to downloaders in one of the coming versions. Only upload of NZBs to downloaders will be supported. v2 is capable of handling it without issues and it allows for better control and upload status recognition"
      }
    ]
  },
  {
    "version": "v1.0.18",
    "changes": [
      {
        "type": "fix",
        "text": "Remove test data left in by mistake"
      }
    ]
  },
  {
    "version": "v1.0.17",
    "changes": [
      {
        "type": "feature",
        "text": "Don't require restart for change of log level"
      },
      {
        "type": "feature",
        "text": "Show status updates during update"
      },
      {
        "type": "fix",
        "text": "In some cases restarting resulted in shutdown. If you are affected by this you will to manually update the wrapper from this release"
      },
      {
        "type": "fix",
        "text": "In some cases duplicate detection would throw an exception"
      },
      {
        "type": "feature",
        "text": "Support JSON output for API searches"
      }
    ]
  },
  {
    "version": "v1.0.16",
    "changes": [
      {
        "type": "fix",
        "text": "Make sure users don't enter an insane download limit value"
      },
      {
        "type": "fix",
        "text": "Fix forbidden regexes which might've let some results through"
      },
      {
        "type": "feature",
        "text": "Add option to disable CSRF protection and disable it by default"
      }
    ]
  },
  {
    "version": "v1.0.15",
    "changes": [
      {
        "type": "feature",
        "text": "Pull NZB download status from configured downloaders instead of relying on extension scripts"
      },
      {
        "type": "feature",
        "text": "Add button to check caps for all/all incomplete (yellow) indexers"
      },
      {
        "type": "fix",
        "text": "Anonymize username:password pairs in URLs in logs"
      },
      {
        "type": "fix",
        "text": "Torznab results were returned wrong, preventing Hydra from being added to radarr"
      }
    ]
  },
  {
    "version": "v1.0.14",
    "changes": [
      {
        "type": "fix",
        "text": "Gracefully shutdown when restarting or quitting while search requests are handled"
      }
    ]
  },
  {
    "version": "v1.0.13",
    "changes": [
      {
        "type": "fix",
        "text": "NZBs proxied from indexers were returned with wrong / random seeming file name"
      }
    ]
  },
  {
    "version": "v1.0.12",
    "changes": [
      {
        "type": "feature",
        "text": "Allow migrating only the config, skipping the database migration"
      }
    ]
  },
  {
    "version": "v1.0.11",
    "changes": [
      {
        "type": "fix",
        "text": "Fix error in auth introduced in a previous version"
      }
    ]
  },
  {
    "version": "v1.0.10",
    "changes": [
      {
        "type": "feature",
        "text": "Improve the logging for web exceptions (which are often swallowed which makes debugging harder)"
      },
      {
        "type": "fix",
        "text": "Name of the category would not update in the category dropdown box on the search page"
      },
      {
        "type": "fix",
        "text": "Allow searching without a query in the UI"
      }
    ]
  },
  {
    "version": "v1.0.9",
    "changes": [
      {
        "type": "fix",
        "text": "Allow NZBHydra2 to be shown in an iFrame (e.g. organizr)"
      }
    ]
  },
  {
    "version": "v1.0.8",
    "changes": [
      {
        "type": "fix",
        "text": "Increase lengths for columns which may contain very long texts (errors, queries)"
      }
    ]
  },
  {
    "version": "v1.0.7",
    "changes": [
      {
        "type": "fix",
        "text": "Fix bug in wrapper that I introduced in last version. Oh well..."
      }
    ]
  },
  {
    "version": "v1.0.6",
    "changes": [
      {
        "type": "note",
        "text": "Improve the way the host is determined. External URL should not need to be set when not using a reverse proxy"
      },
      {
        "type": "note",
        "text": "Remove PyYAML dependency from wrapper"
      }
    ]
  },
  {
    "version": "v1.0.5",
    "changes": [
      {
        "type": "note",
        "text": "Make migration a bit more stable"
      },
      {
        "type": "note",
        "text": "Make sure wrapper is started from correct folder"
      }
    ]
  },
  {
    "version": "v1.0.4",
    "changes": [
      {
        "type": "note",
        "text": "So many fixes"
      }
    ]
  },
  {
    "version": "v1.0.3",
    "changes": [
      {
        "type": "note",
        "text": "So many fixes"
      }
    ]
  },
  {
    "version": "v1.0.2",
    "changes": [
      {
        "type": "note",
        "text": "First public release. Welcome!"
      }
    ]
  }
]
